/////////////////////////////////////////////////   
//      Функция таймер для срабатывания       //
//    через опрд кол-во секунд опрд функции  //
////////////////////////////////////////////// 
$(document).ready( async() => {/*Когда страница загруженна мы выполняем функцию добавление стилей*/
     var [tab] = await chrome.tabs.query({ active: true, currentWindow: true });/*Находим активную вкладку*/
        chrome.scripting.executeScript({/*Выполняем скрипт*/
         target:  {tabId: tab.id, allFrames: true},/*Таргет на активную вкладку*/
         function: saglushka,/*Функция таймера*//*Тут будет функция вот эта ------------->srwAtribute<-------------*/
         });/*Конец chrome.scripting*/ 
});/*Конец асинхронной функции*/
/*---------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
function saglushka(){
  console.log("Заглушка")/*Просто заглушка для проверки*/
}
function tes(){/*Фнкция для текста*/
  console.log("Proslo")/*Помощник*/
}/*закрываем функцию проверки*/


    
/*---------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
